




# try:
#     with open (path, 'r', encoding='UTF-8') as file:
#         to_do  = j.load(file)
# except:
#     #to_do = [{'Дата': '5.08.2022', 'Срок':'05.08.2022', 'Задача': 'Почистить зубы', 'Приоритет': 'Срочно', 'Статус':'Сделано'}, {'Дата': '5.08.2022', 'Срок':'05.08.2022', 'Задача': 'Сделать завтрак', 'Приоритет': 'Терпит', 'Статус':'В работе'}, {'Дата': '5.08.2022', 'Срок':'05.08.2022', 'Задача': 'Позавтракать', 'Приоритет': 'Без срока', 'Статус':'Не сделано'}]
#     with open(path, 'w', encoding='UTF-8') as file:
#         j.dump(to_do, file, indent = 2, ensure_ascii=False)

# print(to_do)
    